/*Αρχείο trolley.c
Το πρόγραμμα λαμβάνει δύο τιμές, αριστερό και δεξί κόστος, τις συγκρίνει και τυπώνει 
την πορεία με το χαμηλότερο κόστος. Αν τα κόστη είναι ίσα, τυπώνεται στην οθόνη η αριστερή κατεύθυνση.
Αυτή η διαδικασία επαναλαμβάνεται μέχρι να δοθεί EOF είτε στο αριστερό είτε στο δεξί κόστος.*/

#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    long long int left, right;  //Μεταβλητές για το κόστος αριστερά και δεξιά.
    int check1, check2;     //Μεταβλητές για την αποθήκευση του αποτελέσματος της scanf που βοηθούν στον έλεγχο εγκυρότητας των τιμών εισόδου.


    while(1) //Ατέρμων βρόχος για συνεχή είσοδο τιμών από τον χρήστη.
    {
        //Ζητείται από τον χρήστη να δώσει μια τιμή για το αριστερό κόστος.
        printf("Please enter the cost of going left: ");
        check1 = scanf("%lld", &left); //Εισαγωγή τιμής στο αριστερό κόστος.

        //Αν δοθεί ως είσοδος EOF (Ctrl-D) αντί για αριθμό στην scanf για το αριστερό κόστος, τερματίζεται το πρόγραμμα.
        if(check1 == EOF)
        {
            printf("Terminating.\n");
            exit(0); //Κανονικός τερματισμός.
        }

        //Ζητείται από τον χρήστη να δώσει μια τιμή για το δεξί κόστος.
        printf("Please enter the cost of going right: "); 
        check2 = scanf("%lld", &right); //Εισαγωγή τιμής στο δεξί κόστος.

        //Αν δοθεί ως είσοδος EOF (Ctrl-D) αντί για αριθμό στην scanf για το δεξί κόστος, τερματίζεται το πρόγραμμα.
        if(check2 == EOF)
        {
            printf("No right cost provided.\n"); 
            return 1; //Επιστροφή "1" εξαιτίας εισόδου εκτός προδιαγραφών (απουσία δεξιού κόστους). 
        }

        //Σύγκριση των δύο κόστων και εκτύπωση του αντίστοιχου μηνύματος.
        printf("Go %s.\n", (left <= right) ? "left" : "right");
    }

    return 0; 
}