/*Αρχείο gdc.c
Το πρόγραμμα λαμβάνει μέσω της γραμμής εντολών δύο αριθμούς και χρησιμοποιεί τον 
αλγόριθμο της εκφώνησης για να υπολογίσει τον ΜΚΔ τους και να τον τυπώσει στην οθόνη.*/
#include <stdio.h>
#include <stdlib.h>

long long int gcd(long long int a,long long int b); 

int main(int argc,char* argv[])
{
    long long int num1,num2;

    if(argc!=3) //Έλεγχος αν έχει δοθεί το σωστό πλήθος ορισμάτων στην γραμμή εντολών.
    {
        printf("Usage: %s <num1> <num2>\n",argv[0]);
        exit(1);
    }
    
    num1=atoll(argv[1]); 
    num2=atoll(argv[2]);

    //Έλεγχος για μηδενική είσοδο, αφού ο ΜΚΔ δεν ορίζεται για μηδενικούς αριθμούς.
    if(num1==0 || num2==0)
        return 1;

    //Υπολογισμός και εκτύπωση ΜΚΔ των δύο δοθέντων αριθμών.
    printf("gcd(%lld, %lld) = %lld\n",num1,num2,gcd(num1,num2));

    return 0;
}
//Συνάρτηση που υπολογίζει τον ΜΚΔ δύο αριθμών με αναδρομή.
//Μετατρέπει τους αρνητικούς αριθμούς σε θετικούς για ορθό αποτέλεσμα του ΜΚΔ.
long long int gcd(long long int a,long long int b)
{
    if(a<0)
        a*=-1;

    //Η αναδρομή συνεχίζεται μέχρι το b να μηδενιστεί, οπότε επιστρέφεται το a που περιέχει τον ΜΚΔ.
    return (b==0) ? a : gcd(b, a%b);
}